app/views/forums/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
      <%= link_to forum.forum_name, forum_url(forum.id)%>
      <label class="pull-right">Admin User: <%= link_to User.find_by_id(forum.admin_id).user_name, user_url(forum.admin_id) %></label>

SELECT  1 AS one FROM "watches" WHERE ("watches"."user_id" = 1 AND "watches"."forum_id" = 1) LIMIT 1
SELECT "watches"."forum_id" FROM "watches" WHERE "watches"."user_id" = ?  [["user_id", 2]]
---
      	<div class="col-sm-1">
          <% if Watch.where(user_id: session[:user_id]).pluck(:forum_id).include? forum.id %>