app/views/forums/show.html.erb

SELECT "watches"."forum_id" FROM "watches" WHERE "watches"."user_id" = ?  [["user_id", 2]]
---
    <large class="panel-title"><%= @forum.forum_name %></large>
          <% if Watch.where(user_id: session[:user_id]).pluck(:forum_id).include? @forum.id %>

SELECT COUNT(*) FROM "watches" WHERE "watches"."forum_id" = ?  [["forum_id", 1]]
---
    <div class="col-sm-4">
      <label align="middle">Number of Watchers: <%= Watch.where(forum_id: @forum.id).count %></label>

SELECT "posts".* FROM "posts" WHERE "posts"."forum_id" = ?  ORDER BY date DESC  [["forum_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."forum_id" = ?  [["forum_id", 1]]
---
    <div class="col-sm-4">
      <label align="middle">Number of Posts: <%= Post.where(forum_id: @forum.id).count %></label>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
    <div class="col-sm-4">
      <label align="middle">Administrator: <%= link_to User.find_by_id(@forum.admin_id).user_name, user_url(@forum.admin_id) %></label>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
SELECT "likes"."post_id" FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
                <td><%= post.date %></td>
                <td><%= Comment.where(post_id: post.id).count %></td>
              <td><% if Like.where(user_id: session[:user_id]).pluck(:post_id).include? post.id %>