app/views/comments/edit.html.erb

<% end %>
<% if session[:user_id] != @comment.commenter_id && session[:user_id] != Forum.find_by_id(Post.find_by_id(@comment.post_id).forum_id).admin_id  %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 15]]