app/views/users/index.html.erb

SELECT COUNT(*) FROM "follows" WHERE "follows"."leader_id" = ?  [["leader_id", 1]]
SELECT "follows"."leader_id" FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 3]]
---
            <td><%= user.gender %></td>
            <td><%= Follow.where(leader_id: user.id).count %></td>
            <td>
            <% if Follow.where(follower_id: session[:user_id]).pluck(:leader_id).include? user.id %>