app/views/users/show.html.erb

SELECT "follows"."leader_id" FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 3]]
---
      <% if !session[:user_id].nil? %>
          <% if Follow.where(follower_id: session[:user_id]).pluck(:leader_id).include? @user.id %>

SELECT COUNT(*) FROM "forums" WHERE "forums"."admin_id" = ?  [["admin_id", 2]]
SELECT COUNT(*) FROM "watches" WHERE "watches"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."poster_id" = ?  [["poster_id", 2]]
SELECT COUNT(*) FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 2]]
---
      	<tr>
          <th><%= link_to "Forums", "/forums?user_id=#{@user.id}" %>: <%= Forum.where(admin_id: @user.id).count %></th>
          <th><%= link_to "Watches", "/forums?watch=#{@user.id}" %>: <%= Watch.where(user_id: @user.id).count %></th>
      	  <th><%= link_to "Posts", "/posts?user_id=#{@user.id}" %>: <%= Post.where(poster_id: @user.id).count %></th>
      	  <th><%= link_to "Leaders", "/users?follow=#{@user.id}" %>: <%= Follow.where(follower_id: @user.id).count %></th>