app/views/posts/edit.html.erb

<% end %>
<% if session[:user_id] != @post.poster_id && session[:user_id] != Forum.find_by_id(@post.forum_id).admin_id %>
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 12]]