app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."poster_id" = ?  [["poster_id", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "likes"."post_id" FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 3]]
---
            <td><%= link_to post.title, post_url(post.id) %></td>
            <td><%= link_to User.find_by_id(post.poster_id).user_name, user_url(post.poster_id) %></td>
            <td><%= post.date %></td>
            <td><%= Comment.where(post_id: post.id).count %></td>
            <td><% if Like.where(user_id: session[:user_id]).pluck(:post_id).include? post.id %>