app/views/posts/show.html.erb

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
---
  <div class="panel-heading" align="middle">
    <%= link_to Forum.find_by_id(@post.forum_id).forum_name, forum_url(@post.forum_id) %>

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
---

        <% if !session[:user_id].nil? && (session[:user_id] == @post.poster_id || session[:user_id] == Forum.find_by_id(@post.forum_id).admin_id ) %>

SELECT "likes"."post_id" FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 3]]
---
        <% if !session[:user_id].nil? %>
<% if Like.where(user_id: session[:user_id]).pluck(:post_id).include? @post.id %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
      <div class="col-sm-2">
        <img src="<%= User.find_by_id(@post.poster_id).avatar %>" height="100" width="100" ></img><br>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY date DESC  [["post_id", 2]]
---
      <div class="col-sm-2">
        <img src="<%= User.find_by_id(comment.commenter_id).avatar %>" height="100" width="100" ></img><br>