app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("post_id", "date", "content", "commenter") VALUES (?, ?, ?, ?)  [["post_id", 3], ["date", "2015-05-17 16:33:09.000000"], ["content", "acsd"], ["commenter", "God Liang"]]
---
  def create
    if (Post.find_by_id(params[:post_id]).level.present?)&&(User.find_by_id(session[:user_id]).level.to_i < Post.find_by_id(params[:post_id]).level)

      redirect_to post_url(params[:post_id]), notice: "Comment Failed! Your level is too low to comment this post!"

    else
  	@comment = Comment.new(post_id: params[:post_id].to_i,
                 date: Time.new.strftime("%Y-%m-%d %H:%M:%S"),
                 content: params[:content],
                 commenter_id: session[:user_id])
    @user = User.find_by_id(@comment.commenter_id)
    @post = Post.find_by_id(@comment.post_id)
    @poster = User.find_by_id(@post.poster_id)
    @x = Level.find_by(user_id: @user.id)
    @level = @x.level
    if @level <= 15 && @comment.commenter_id != @poster.id
      @level = @level + 0.5/(@level+1)
      @x.update level: @level
      @x.save
    end
    @x1 = Level.find_by(user_id: @poster.id)
    @level1 = @x1.level
    if @level1 <= 15 && @comment.commenter_id != @poster.id
      @level1 = @level1 + 0.9/(@level1+1)
      @x1.update level: @level1
      @x1.save
    end

    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 15]]
UPDATE "comments" SET "content" = ? WHERE "comments"."id" = ?  [["content", "nimabiya sbaiaaa123123123"], ["id", 15]]
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update content: params[:content]

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @post = Post.find_by_id(@comment.post_id)
    @comment.delete