app/controllers/follows_controller.rb

INSERT INTO "follows" ("follower_id", "leader_id") VALUES (?, ?)  [["follower_id", 1], ["leader_id", 2]]
---
  def create
    @follow = Follow.create(follower_id: session[:user_id], leader_id: params[:id])

SELECT  "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."leader_id" = ? LIMIT 1  [["follower_id", 1], ["leader_id", 2]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
---
  def destroy
  	@follow = Follow.find_by(follower_id: session[:user_id], leader_id: params[:id])
  	@follow.destroy