app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums" WHERE (forum_name LIKE '%A%')
SELECT "forums".* FROM "forums" WHERE "forums"."admin_id" = ?  [["admin_id", 3]]
SELECT "watches"."forum_id" FROM "watches" WHERE "watches"."user_id" = ?  [["user_id", 2]]
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
SELECT "watches".* FROM "watches" WHERE "watches"."user_id" = ?  [["user_id", 3]]
SELECT "forums".* FROM "forums"
---
	def index
    @page = params[:page].to_i
    if @page.nil?
      @page = 0
    end
    if params[:search].present?
      @forums = Forum.where("forum_name LIKE ?", "%#{params["search"]}%")
    elsif params[:user_id].present?
      @forums = Forum.where(admin_id: params[:user_id])
    elsif params[:watch].present?
      @watches = Watch.where(user_id: params[:watch]).pluck(:forum_id)
      @forums = Forum.where(:id => @watches)
    else
		  @forums = Forum.all

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."forum_id" = ?  ORDER BY date DESC  [["forum_id", 1]]
---
  def show
    @forum = Forum.find(params[:id])
    @posts = Post.where(forum_id: @forum.id).order(top: :desc).order(date: :desc)

INSERT INTO "forums" ("forum_name", "description", "admin_id") VALUES (?, ?, ?)  [["forum_name", "12321"], ["description", "3213"], ["admin_id", 1]]
---
  def create
  	@forum = Forum.create(forum_name: params[:forum_name],
                 description: params[:description],
                 admin_id: session[:user_id])

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @forum = Forum.find(params[:id])

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "forums" SET "description" = ? WHERE "forums"."id" = ?  [["description", "A forum allowing you to post acadamy-related questions and discussions1"], ["id", 1]]
---
  def update
    @forum = Forum.find(params[:id])
    @forum.update forum_name: params[:forum_name],
                 description: params[:description]

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "forums" WHERE "forums"."id" = ?  [["id", 1]]
---
  def destroy
    @forum = Forum.find_by_id(params[:id])

    @forum.destroy