app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id") VALUES (?, ?)  [["user_id", 1], ["post_id", 2]]
---
  def create
    @like = Like.create(user_id: session[:user_id], post_id: params[:id])

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT 1  [["user_id", 1], ["post_id", 2]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
  def destroy
  	@like = Like.find_by(user_id: session[:user_id], post_id: params[:id])
  	@like.destroy