app/controllers/posts_controller.rb

  def create
  	@post = Post.create(forum_id: params[:forum_id].to_i,
                 title: params[:title],
                 content: params[:content],
                 level: params[:level].to_i,
                 date: Time.new.strftime("%Y-%m-%d %H:%M:%S"),
                 top: params[:top] == "true",
                 important: params[:important] == "true",
                 poster_id: session[:user_id])
    @user = User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]