app/controllers/posts_controller.rb

  def index
    if params[:search].present?
      @posts = Post.where("title LIKE '%#{params["search"]}%'")
    elsif params[:user_id].present?
      @posts = Post.where(poster_id: params[:user_id])
    elsif params[:like].present?
      @likes = Like.where(user_id: params[:like]).pluck(:post_id)
      @posts = Post.where(:id => @likes)
    else
      @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%a%')
SELECT "posts".* FROM "posts" WHERE "posts"."poster_id" = ?  [["poster_id", 0]]
SELECT "likes"."post_id" FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (1, 2)
SELECT "posts".* FROM "posts"

  def show
    @post = Post.find(params[:id])
    @comments = Comment.where(post_id: @post.id).order('date')
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY date DESC  [["post_id", 2]]

  def create
  	@post = Post.create(forum_id: params[:forum_id].to_i,
                 title: params[:title],
                 content: params[:content],
                 date: Time.new.strftime("%Y-%m-%d %H:%M:%S"),
                 top: params[:top] == "true",
                 important: params[:important] == "true",
                 poster_id: session[:user_id])
---
INSERT INTO "posts" ("forum_name", "title", "content", "date", "top", "important", "poster") VALUES (?, ?, ?, ?, ?, ?, ?)  [["forum_name", "Academy"], ["title", "3213"], ["content", "321"], ["date", "2015-03-04 10:30:22.000000"], ["top", "t"], ["important", "t"], ["poster", "Karin"]]

  def update
    @post = Post.find(params[:id])
    @post.update title: params[:title],
                 content: params[:content],
                 date: Time.new.strftime("%Y-%m-%d %H:%M:%S"),
                 top: params[:top] == "true",
                 important: params[:important] == "true"
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "posts" SET "title" = ?, "content" = ?, "date" = ?, "important" = ? WHERE "posts"."id" = ?  [["title", nil], ["content", "nimabiya sbai shabi"], ["date", "2015-05-17 16:55:32.000000"], ["important", "f"], ["id", 1]]

  def destroy
    @post = Post.find_by_id(params[:id])
    @forum = @post.forum_id

    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]