app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "God Liang"]]
---
  def create
    if(session[:user_id].present?)
      redirect_to "#", notice: "You've already signed in!"
    end
    user = User.find_by(user_name: params[:user_name])