app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (user_name LIKE '%a%')
SELECT "follows"."leader_id" FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "users".* FROM "users"
---
  def index
    if params[:search].present?
      @users = User.where("user_name LIKE '%#{params["search"]}%'")
    elsif params[:follow].present?
      @leaders = Follow.where(follower_id: params[:follow]).pluck(:leader_id)
      @users = User.where(:id => @leaders)
    elsif params[:leader].present?
      @followers = Follow.where(leader_id: params[:leader]).pluck(:follower_id)
      @users = User.where(:id => @followers)
    else
      @users = User.all

INSERT INTO "users" ("user_name", "password", "level", "birthday", "real_name", "address", "email", "gender") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["user_name", "111"], ["password", "111"], ["level", 0.0], ["birthday", "2010-03-02 00:00:00.000000"], ["real_name", "111"], ["address", "111"], ["email", "111@1.co"], ["gender", "111"]]
---
  def create
    @user = User.new(user_name: params[:user_name],
      password: params[:password],
      level: 0.0,
      birthday: params[:date].to_date,
      real_name: params[:real_name],
      address: params[:address],
      email: params[:email],
      gender: params[:gender])

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def editpw
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "real_name" = ?, "birthday" = ? WHERE "users"."id" = ?  [["real_name", "123324234"], ["birthday", "0001-01-11 00:00:00.000000"], ["id", 6]]
---
  def update
    @user = User.find(params[:id])
    @pw1 = params[:pw1]
    @pw2 = params[:pw2]
    if @pw1.nil? || @pw2.nil? || @pw1.length < 1 || @pw2.length < 1
      redirect_to user_url(@user.id), notice: "Failed! Invalid password"
    elsif @pw1 != @pw2
      redirect_to user_url(@user.id), notice: "Failed! Re-enter password not match"
    else
    @user.update real_name: params[:real_name],
    address: params[:address],
    email: params[:email],
    password: params[:pw1],
    birthday: params[:birthday].to_date

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
  def destroy
    @user = User.find_by_id(params[:id])

    @user.destroy