app/controllers/watches_controller.rb

  def create
    @watch = Watch.create(user_id: session[:user_id], forum_id: params[:id])
---
INSERT INTO "watches" ("user_id", "forum_id") VALUES (?, ?)  [["user_id", 1], ["forum_id", 1]]

  def destroy
  	@watch = Watch.find_by(user_id: session[:user_id], forum_id: params[:id])
  	@watch.destroy
---
SELECT  "watches".* FROM "watches" WHERE "watches"."user_id" = ? AND "watches"."forum_id" = ? LIMIT 1  [["user_id", 1], ["forum_id", 1]]
DELETE FROM "watches" WHERE "watches"."id" = ?  [["id", 5]]